import { IDict } from '../pages/Third';

export const engineLocation: IDict = {
  'переднее продольное': '1',
  'переднее поперечное': '2',
  'заднее продольное': '3',
  'продольное, перед задней осью': '4',
  'среднее продольное': '5',
  'переднее, поперечное': '6',
  'заднее, поперечное': '7',
  'продольное, на заднем свесе': '10',
  'продольное в заднем свесе': '11',
  'двигатель в пределах базы': '12',
  'в базе, продольное': '13',
  'продольное, в заднем свесе': '14',
  'заднее поперечное': '17',
  'в средней продольной плоскости': '19',
  продольное: '20',
  поперечное: '22',
  'между лонжеронами рамы под кузовом': '40',
  'два электродвигателя спереди и сзади, поперечное': '42',
  'в колесных модулях электропортального моста': '44',
  'два электродвигателя, расположенных поперечно над передней и задней осями': '45',
  'в базе, поперечное': '47',
  'с вертикально расположенным цилиндром': '48',
  'продольное, за кабиной': '49',
  'один электродвигатель, расположенный поперечно над задней осью': '50',
  'один двигатель над передней осью и два двигателя на задней оси': '52',
  'в ступице заднего колеса (мотор-колесо)': '23398129',
  'два электродвигателя, выполненных в едином конструктивном блоке с мостом второй оси': '23766747',
  'ось коленчатого вала перпендикулярна продольной плоскости транспортного средства': '23766748',
  'три электродвигателя, расположенных поперечно продольной плоскости транспортного средства, один над передней осью и два над задней':
    '23766749',
  'два электродвигателя, выполненных в едином конструктивном блоке с мостом третьей оси':
    '23766750',
  'в едином конструктивном блоке с мостом второй оси': '23766751',
  'в едином конструктивном блоке с мостом третьей оси': '23766752'
};
