import { IDict } from '../pages';

export const ignitionSystems: IDict = {
  электронная: '03',
  'электронная, со статическим распределителем': '031',
  'электронная, бесконтактная': '033',
  'бесконтактная, с электронным управлением': '34',
  'электронная, бесконтактная, микропроцессорная': '36',
  'однопроводная, батарейная, микропроцессорная': '37',
  транзисторная: '38',
  бесконтактная: '40',
  контактная: '41',
  'электронная, со встроенным датчиком детонации': '48',
  микропроцессорная: '105',
  'с электронным управлением': '107',
  'электронная, бесконтактная, с индуктивным датчиком и электронным коммутатором CDI': '143',
  'микропроцессорное принудительное зажигание': '144',
  'индивидуальная катушка и свеча зажигания': '145',
  'электронная, конденсаторная': '146',
  'электронная система с индуктивным разрядом': '147'
};
