import { IDict } from '../pages/Third';

export const massType: IDict = {
  'Технически допустимая максимальная масса, приходящаяся на каждую из осей, начиная с передней оси':
    '07',
  'Технически допустимая максимальная масса, приходящаяся на переднее колесо': '08',
  'Технически допустимая максимальная масса, приходящаяся на заднее колесо': '09',
  'Масса транспортного средства (шасси транспортного средства) в снаряженном состоянии': '10',
  'Технически допустимая максимальная масса транспортного средства': '12',
  'Технически допустимая максимальная масса автопоезда': '14',
  'Технически допустимая общая масса самоходной машины (другого вида техники) и прицепа': '20',
  'Полезная нагрузка самоходной машины (другого вида техники)': '22',
  'Снаряженная (эксплуатационная) масса самоходной машины (другого вида техники)': '24',
  'Технически допустимая максимальная масса, приходящаяся на ось бокового прицепа': '25',
  'Технически допустимая максимальная масса самоходной машины (другого вида техники)': '27'
};
