import { IDict } from '../interfaces/interfaces';

export const suspension: IDict = {
  передняя: '01',
  задняя: '02',
  'одна подвеска': '03',
  'бокового прицепа': '04',
  '1-ой оси': '05',
  '2-ой оси': '06',
  '3-ой оси': '07',
  '4-ой оси': '08',
  '5-ой оси': '09',
  '6-ой оси': '10',
  '7-ой оси': '11',
  '8-ой оси': '12',
  '9-ой оси': '13',
  '10-ой оси': '14',
  '11-ой оси': '15',
  '12-ой оси': '16',
  '13-ой оси': '17',
  '14-ой оси': '18',
  '15-ой оси': '19',
  '16-ой оси': '20',
  '17-ой оси': '21',
  '18-ой оси': '22',
  '19-ой оси': '23',
  '20-ой оси': '24'
};
