import { IDict } from '../pages/Third';

export const typeTransmisson: IDict = {
  'механическая, с ручным управлением': '45',
  'механическая, с автоматическим управлением': '46',
  'механическая, с автоматическим и возможностью ручного управления': '47',
  'гидромеханическая, с автоматическим управлением': '48',
  'гидромеханическая, с автоматическим и возможностью ручного управления': '49',
  'электрическая, с автоматическим управлением': '50',
  'электрическая, с автоматическим и возможностью ручного управления': '51',
  'электромеханическая, с автоматическим управлением': '52',
  'электромеханическая, с автоматическим и возможностью ручного управления': '53',
  'гидростатическая, с автоматическим управлением': '54',
  'гидростатическая, с автоматическим и возможностью ручного управления': '55',
  'гидравлическая, с автоматическим управлением': '56',
  'гидравлическая, с автоматическим и возможностью ручного управления': '57',
  'механическая, с автоматическим управлением (передняя ось)': '59',
  'механическая, с автоматическим управлением (задняя ось)': '60',
  'механическая, для категории L': '61',
  'гидростатическая, с ручным управлением': '62',
  'гидромеханическая, с ручным управлением': '63'
};
